server/app/controllers/parcels_controller.rb

  def show
    @parcel = current_user.parcels.find_by(id: params[:id])
---
SELECT "parcels".* FROM "parcels" WHERE "parcels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]