server/app/controllers/parcels_controller.rb

  def create
    puts "Current User ID: #{current_user.id}"
    @parcel = current_user.parcels.build(parcel_params)

    if @parcel.save
---
INSERT INTO "parcels" ("sender_name", "sender_email", "sender_address", "receiver_name", "receiver_email", "receiver_address", "receiver_country", "weight", "type_of_shipment", "created_at", "updated_at", "user_id", "tracking_number", "status", "location", "sender_phone_number", "receiver_phone_number") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @parcel = current_user.parcels.find_by(tracking_number: params[:id])
---
SELECT "parcels".* FROM "parcels" WHERE "parcels"."user_id" = ? AND "parcels"."tracking_number" = ? LIMIT ?  [["user_id", 1], ["tracking_number", "7AB5AF2C4DD1"], ["LIMIT", 1]]

  def update
    @parcel = current_user.parcels.find_by(id: params[:id])

    if @parcel.nil?
      render json: { error: "Parcel not found" }, status: :not_found
      return
    end

    if @parcel.update(destination_params)
      render json: { message: 'Parcel destination updated successfully' }, status: :ok
    else
      render json: { error: @parcel.errors.full_messages.join(', ') }, status: :unprocessable_entity
---
SELECT "parcels".* FROM "parcels" WHERE "parcels"."user_id" = ? AND "parcels"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
UPDATE "parcels" SET "receiver_address" = ?, "updated_at" = ? WHERE "parcels"."id" = ?  [["receiver_address", "Nottingham"], ["updated_at", "2023-08-10 15:47:01.446163"], ["id", 4]]
SELECT "parcels".* FROM "parcels" WHERE "parcels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def admin_dashboard
    if current_user&.is_admin
      @parcels = Parcel.all
---
SELECT "parcels".* FROM "parcels"

  def update_admin_dashboard
    @parcel = Parcel.find_by(id: params[:id])

    if @parcel.nil?
      render json: { error: "Parcel not found" }, status: :not_found
      return
    end

    if @parcel.update(parcel_status_params)
      render json: { message: 'Parcel status updated successfully' }, status: :ok
    else
      render json: { error: @parcel.errors.full_messages.join(', ') }, status: :unprocessable_entity
---
SELECT "parcels".* FROM "parcels" WHERE "parcels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @parcel = Parcel.find_by(id: params[:id])

    if @parcel.nil?
      render json: { error: "Parcel not found" }, status: :not_found
      return
    end

    if @parcel.destroy
---
SELECT "parcels".* FROM "parcels" WHERE "parcels"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "parcels" WHERE "parcels"."id" = ?  [["id", 8]]

  def update_status_and_location
    @parcel = Parcel.find_by(id: params[:id])

    if @parcel.nil?
      render json: { error: "Parcel not found" }, status: :not_found
      return
    end

    if @parcel.update(status: params[:status],location: params[:location])
      render json: { message: 'Parcel status and location updated successfully' }, status: :ok
    else
      render json: { error: @parcel.errors.full_messages.join(', ') }, status: :unprocessable_entity
---
SELECT "parcels".* FROM "parcels" WHERE "parcels"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "parcels" SET "updated_at" = ?, "status" = ? WHERE "parcels"."id" = ?  [["updated_at", "2023-08-10 15:51:20.186572"], ["status", "pending"], ["id", 5]]
SELECT "parcels".* FROM "parcels" WHERE "parcels"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]