server/app/controllers/parcels_controller.rb

  def index
    parcels = Parcel.all

    if parcels.any?
---
SELECT "parcels".* FROM "parcels"
SELECT 1 AS one FROM "parcels" LIMIT ?  [["LIMIT", 1]]

  def update
    # The user can only cancel or change the destination of a parcel delivery when the parcel’s status is yet to be marked as delivered.
    if @parcel
      if current_user_can_update_parcel? && @parcel.update(parcel_update_params) && @admin_use
---
UPDATE "parcels" SET "updated_at" = ?, "destination" = ? WHERE "parcels"."id" = ?  [["updated_at", "2023-07-31 08:55:28.353621"], ["destination", "Nairobi Ngong road"], ["id", 1]]