server/app/controllers/user_controller.rb

    def show
        user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "email", "phone_number", "address", "created_at", "updated_at", "admin_tag") VALUES (?, ?, ?, ?, ?, ?, ?, ?)