server/app/controllers/api/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Khristine"], ["email", "kris@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-08-05 15:05:49.308693"], ["updated_at", "2023-08-05 15:05:49.308693"]]
---
  def create
    user = User.new(user_params)

    if user.save